Good evening @thebriankeys,

thank you for reporting the issue and the detailed steps for reproducing it!

Following  your instructions I am also ending up in the error message. I used Terraform v1.5.7 in combination with AWS provider version 5.30.0.

```shell
❯ terraform version
Terraform v1.5.7
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v5.30.0

Your version of Terraform is out of date! The latest version
is 1.10.1. You can update by downloading from https://www.terraform.io/downloads.html
❯ terraform plan
╷
│ Error: expected user_settings.0.action to be one of ["CLIPBOARD_COPY_FROM_LOCAL_DEVICE" "CLIPBOARD_COPY_TO_LOCAL_DEVICE" "FILE_UPLOAD" "FILE_DOWNLOAD" "PRINTING_TO_LOCAL_DEVICE" "DOMAIN_PASSWORD_SIGNIN" "DOMAIN_SMART_CARD_SIGNIN"], got AUTO_TIME_ZONE_REDIRECTION
│ 
│   with aws_appstream_stack.stack,
│   on main.tf line 1, in resource "aws_appstream_stack" "stack":
│    1: resource "aws_appstream_stack" "stack" {
│ 
```
I tracked back the issue to missing support in the AWS Go SDKv2 version used as part of AWS provider 5.30.0.

The functionality was added to the AWS Go SDK v2 in October `24 ([Release notes](https://github.com/aws/aws-sdk-go-v2/blob/release-2024-10-02/service/appstream/CHANGELOG.md#v1400-2024-10-02))

The current release v5.80.0 (and to my current understanding also v5.78.0) use a newer version of the SDK and hence should work for you.

```shell
❯ terraform version
Terraform v1.5.7
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v5.80.0

Your version of Terraform is out of date! The latest version
is 1.10.1. You can update by downloading from https://www.terraform.io/downloads.html
❯ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_appstream_stack.stack will be created
  + resource "aws_appstream_stack" "stack" {
      + arn                = (known after apply)
      + created_time       = (known after apply)
      + description        = "example stack"
      + display_name       = "example stack"
      + embed_host_domains = (known after apply)
      + feedback_url       = (known after apply)
      + id                 = (known after apply)
      + name               = "example-stack"
      + redirect_url       = (known after apply)
      + tags_all           = (known after apply)

      + application_settings {
          + enabled = false
        }

      + storage_connectors {
          + connector_type      = "HOMEFOLDERS"
          + domains             = (known after apply)
          + resource_identifier = (known after apply)
        }

      + user_settings {
          + action     = "AUTO_TIME_ZONE_REDIRECTION"
          + permission = "DISABLED"
        }
      + user_settings {
          + action     = "CLIPBOARD_COPY_FROM_LOCAL_DEVICE"
          + permission = "ENABLED"
        }
      + user_settings {
          + action     = "CLIPBOARD_COPY_TO_LOCAL_DEVICE"
          + permission = "ENABLED"
        }
      + user_settings {
          + action     = "DOMAIN_PASSWORD_SIGNIN"
          + permission = "ENABLED"
        }
      + user_settings {
          + action     = "DOMAIN_SMART_CARD_SIGNIN"
          + permission = "DISABLED"
        }
      + user_settings {
          + action     = "FILE_DOWNLOAD"
          + permission = "ENABLED"
        }
      + user_settings {
          + action     = "FILE_UPLOAD"
          + permission = "ENABLED"
        }
      + user_settings {
          + action     = "PRINTING_TO_LOCAL_DEVICE"
          + permission = "ENABLED"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

As you can see, the plan phase succeeds.